# Store Sales of Corporation Favorita

## Business Analysis

#### This project revolves around time series forecasting with the objective of predicting store sales using data from Corporation Favorita, a prominent grocery retailer based in Ecuador. The primary goal is to develop a model that enhances the accuracy of predicting unit sales for a myriad of items sold across various Favorita stores.

### Hypothesis

### Import libraries

In [4]:
import numpy as np
import pandas as pd
import seaborn as sns 
import pyodbc
import matplotlib.pyplot as plt

## Load datasets

In [1]:
# Load environment variables from .env file into a dictionary
from dotenv import  dotenv_values
environment_variables = dotenv_values('.env')
 
# Get the values for the credentials you set in the '.env' file
server = environment_variables.get("SERVER")
database = environment_variables.get("DATABASE")
username = environment_variables.get("USER")
password = environment_variables.get("PASSWORD")
 

connection_string = f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password};MARS_Connection=yes;MinProtocolVersion=TLSv1.2;"

In [2]:
print(connection_string)

DRIVER={SQL Server};SERVER=dap-projects-database.database.windows.net;DATABASE=dapDB;UID=learning_project_3;PWD=A$uB1Lp3$2@24;MARS_Connection=yes;MinProtocolVersion=TLSv1.2;

In [5]:
connection = pyodbc.connect(connection_string)

In [7]:
query='SELECT * from dbo.oil'

df_oil=pd.read_sql(query, connection)

df_oil.head()

C:\Users\DELL\AppData\Local\Temp\ipykernel_12236\1830175885.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_oil=pd.read_sql(query, connection)

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02   93.139999
2  2013-01-03   92.970001
3  2013-01-04   93.120003
4  2013-01-07   93.199997

In [17]:
df_oil.isnull().sum()

date           0
dcoilwtico    43
dtype: int64

In [42]:
df_oil.shape

(1218, 2)

In [43]:
df_oil.describe()

        dcoilwtico
count  1175.000000
mean     67.714366
std      25.630476
min      26.190001
25%      46.405001
50%      53.189999
75%      95.660000
max     110.620003

In [9]:
query_2='SELECT * from dbo.holidays_events'
df_holidays_events=pd.read_sql(query_2, connection)
df_holidays_events.head()

C:\Users\DELL\AppData\Local\Temp\ipykernel_12236\1523891044.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_holidays_events=pd.read_sql(query_2, connection)

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [20]:
df_holidays_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    object
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), object(5)
memory usage: 14.1+ KB

In [18]:
df_holidays_events.isnull().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [40]:
df_holidays_events.shape

(350, 6)

In [41]:
df_holidays_events.describe()

              date     type    locale locale_name description transferred
count          350      350       350         350         350         350
unique         312        6         3          24         103           2
top     2014-06-25  Holiday  National     Ecuador    Carnaval       False
freq             4      221       174         174          10         338

In [ ]:
d

In [10]:
query_3 ='SELECT * from dbo.stores'
df_stores=pd.read_sql(query_3, connection)
df_stores.head()

C:\Users\DELL\AppData\Local\Temp\ipykernel_12236\1250326291.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_stores=pd.read_sql(query_3, connection)

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [21]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB

In [19]:
df_stores.isnull().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [38]:
df_stores.shape

(54, 5)

In [39]:
df_stores.describe()

       store_nbr    cluster
count  54.000000  54.000000
mean   27.500000   8.481481
std    15.732133   4.693395
min     1.000000   1.000000
25%    14.250000   4.000000
50%    27.500000   8.500000
75%    40.750000  13.000000
max    54.000000  17.000000

In [11]:
dt=pd.read_csv('train.csv')
dt.head()

   id      date  store_nbr      family  sales  onpromotion
0   0  1/1/2013          1  AUTOMOTIVE    0.0            0
1   1  1/1/2013          1   BABY CARE    0.0            0
2   2  1/1/2013          1      BEAUTY    0.0            0
3   3  1/1/2013          1   BEVERAGES    0.0            0
4   4  1/1/2013          1       BOOKS    0.0            0

In [22]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1048575 non-null  int64
 1   date         1048575 non-null  object
 2   store_nbr    1048575 non-null  int64
 3   family       1048575 non-null  object
 4   sales        1048575 non-null  float64
 5   onpromotion  1048575 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 48.0+ MB

In [23]:
dt.isnull().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [36]:
dt.shape

(1048575, 6)

In [37]:
dt.describe()

                 id     store_nbr         sales   onpromotion
count  1.048575e+06  1.048575e+06  1.048575e+06  1.048575e+06
mean   5.242870e+05  2.749256e+01  2.445326e+02  1.147634e-01
std    3.026977e+05  1.558408e+01  8.065892e+02  2.377814e+00
min    0.000000e+00  1.000000e+00  0.000000e+00  0.000000e+00
25%    2.621435e+05  1.400000e+01  0.000000e+00  0.000000e+00
50%    5.242870e+05  2.700000e+01  1.000000e+00  0.000000e+00
75%    7.864305e+05  4.100000e+01  1.200000e+02  0.000000e+00
max    1.048574e+06  5.400000e+01  4.627100e+04  1.960000e+02

In [14]:
dt2=pd.read_csv('transactions.csv')
dt2.head()

       date  store_nbr  transactions
0  1/1/2013         25           770
1  1/2/2013          1          2111
2  1/2/2013          2          2358
3  1/2/2013          3          3487
4  1/2/2013          4          1922

In [24]:
dt2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [25]:
dt2.isnull().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [34]:
dt2.shape

(83488, 3)

In [35]:
dt2.describe()

          store_nbr  transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [15]:
dt3=pd.read_csv('sample_submission.csv')
dt3.head()

        id  sales
0  3000888    0.0
1  3000889    0.0
2  3000890    0.0
3  3000891    0.0
4  3000892    0.0

In [26]:
dt3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      28512 non-null  int64
 1   sales   28512 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 445.6 KB

In [27]:
dt3.isnull().sum()

id       0
sales    0
dtype: int64

In [32]:
dt3.shape

(28512, 2)

In [33]:
dt3.describe()

                 id    sales
count  2.851200e+04  28512.0
mean   3.015144e+06      0.0
std    8.230850e+03      0.0
min    3.000888e+06      0.0
25%    3.008016e+06      0.0
50%    3.015144e+06      0.0
75%    3.022271e+06      0.0
max    3.029399e+06      0.0

In [16]:
dt4=pd.read_csv('test.csv')
dt4.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [28]:
dt4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  object
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB

In [29]:
dt4.isnull().sum()

id             0
date           0
store_nbr      0
family         0
onpromotion    0
dtype: int64

In [30]:
dt4.shape

(28512, 5)

In [31]:
dt4.describe()

                 id     store_nbr   onpromotion
count  2.851200e+04  28512.000000  28512.000000
mean   3.015144e+06     27.500000      6.965383
std    8.230850e+03     15.586057     20.683952
min    3.000888e+06      1.000000      0.000000
25%    3.008016e+06     14.000000      0.000000
50%    3.015144e+06     27.500000      0.000000
75%    3.022271e+06     41.000000      6.000000
max    3.029399e+06     54.000000    646.000000

# EDA ANALYSIS